tap "dopplerhq/cli"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "stripe/stripe-cli"

brew "opensearch", restart_service: true
brew "postgresql@14", restart_service: true
brew "redis", restart_service: true

brew "coreutils"
brew "curl"
brew "dopplerhq/cli/doppler"
brew "git-lfs"
brew "git"
brew "gnupg"
brew "heroku/brew/heroku"
brew "imagemagick"
brew "libyaml"
brew "pgvector"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "yarn"
brew "vips"
brew "zsh-autosuggestions"

cask "arc"
cask "cleanshot"
cask "finicky"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "github"
cask "handbrake"
cask "languagetool"
cask "iterm2"
cask "maccy"
cask "postico"
cask "rectangle"
cask "visual-studio-code"
cask "vivid"

mas "1Password", id: 443987910
mas "RunCat", id: 1429033973
mas "Slack for Desktop", id: 803453959

vscode "benspaulding.procfile"
vscode "Blinknlights.fuzzy-ruby-server"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dnicolson.binary-plist"
vscode "esbenp.prettier-vscode"
vscode "Fooo.ruby-spec-runner"
vscode "GauravSharma.colorized-access-modifier"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "kirillplatonov.erb-toggle"
vscode "leighlondon.eml"
vscode "maattdd.gitless"
vscode "mechatroner.rainbow-csv"
vscode "ms-vscode.test-adapter-converter"
vscode "pavlitsky.yard"
vscode "sainnhe.sonokai"
vscode "Shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sporto.rails-go-to-spec"
vscode "testdouble.vscode-standard-ruby"
vscode "tmikoss.rails-latest-migration"
vscode "tonsky.theme-alabaster"
vscode "zhuangtongfa.material-theme"
